ExcessiveOverkill/drive-software-dev/STM32F413RG/Core/Src/main.c
#include "main.h"
#include <math.h>
#include "stm32f413xx.h"

#define SYSCLK		100		// (MHz) System Clock in MHz
#define ADCCLK		20		// (MHz) ADC output clock
#define DEADTIME	100		// (ns)  PWM Deadtime (ns)
#define PWMCLK		25		// (KHz) PWM Output Frequency

#define PWM_ticks 1000*SYSCLK/PWMCLK/2

#define ADC_VOLTAGE 0.250			// (V) ADC optimal shunt input voltage
#define ADC_MIN_VALUE_PERC 0.1094
#define DFSDM_DIVISIONS 8388608
#define DFSDM_FOSR (1000*ADCCLK/PWMCLK/2 - 2)

#define VBUS 12
#define SHUNT_RESISTANCE 0.005	// (Ohms) Current shunt resistance

#define pi 3.141592653589793


float Kp = .1;		// Proportional gain for current controller (V/A)
float Ki = .1;		// Integral gain for current controller (V/A/s)
float I_term_limit = 3;


float requested_Iq = 3.0;
float requested_Id = 0.0;
float electrical_rads_per_second = 10.0;

float theta = 0.0;

// DO NOT MODIFY THESE OUTSIDE OF ISR FUNCTION
uint32_t CAPTURE_COMP_U = PWM_ticks * 0.5;
uint32_t CAPTURE_COMP_V = PWM_ticks * 0.5;
uint32_t CAPTURE_COMP_W = PWM_ticks * 0.5;
float I_Term = 0;	// Integral term for current controller (V)

// TODO: Remove these...
uint8_t I2C_address = 0b01000001;
uint8_t I2C_Register_Address = 0b10100000;
uint8_t* I2C_data = &I2C_Register_Address;
uint8_t I2C_data_size = 1;


void delay_us(uint32_t time_us);

void CPU_init(void);

void I2C1_init(void);
void I2C1_Start_Transmit(uint8_t address, uint8_t* data, uint8_t size) ;

void I2C1_Event_Interrupt_Handler(void);
void I2C1_Error_Interrupt_Handler(void);
void Start_Bit_Sent_Callback(void);
void Address_Sent_Callback(void);
void Ten_Bit_Header_Sent_Callback(void);
void Stop_Received_Callback(void);
void Data_Byte_Transfer_Finished_Callback(void);
void Receive_Buffer_Not_Empty_Callback(void);
void Transmit_Buffer_Empty_Callback(void);
void Bus_Error_Callback(void);
void Arbitration_Loss_Callback(void);
void Acknowledge_Failure_Callback(void);
void Overrun_Underrun_Callback(void);
void PEC_Error_Callback(void);
void Timeout_Tlow_Error_Callback(void);
void SMBus_Alert_Callback(void);

void USART6_init(void);
void USART6_Error_Interrupt_Handler(void);
void Parity_Error_Callback(void);
void Framing_Error_Callback(void);
void Noise_Detected_Error_Callback(void);
void Overrun_Error_Callback(void);

void TIM1_init(void);

void TIM2_init(void);
void PWM_enable(void);

void DFSDM2_init(void);

int Clarke_and_Park_Transform(float theta, float A, float B, float C, float *D, float *Q);
int Inverse_Carke_and_Park_Transform(float theta, float D, float Q, float *A, float *B, float *C);

void FPU_IRQHandler(void);
void HardFault_Handler(void);
void MemManage_Handler(void);
void BusFault_Handler(void);
void UsageFault_Handler(void);

int main(void){

	CPU_init();
	// GPIO_init();
	// TIM1_init();
	// TIM2_init();
	// DFSDM2_init();
	// PWM_enable();
	I2C1_init();

	while(1){
		I2C1_Start_Transmit(I2C_address, I2C_data, I2C_data_size);

		delay_us(1000000);
	}
}

void delay_us(uint32_t time_us) {
	 TIM2->CNT = 0;
	 while (TIM2->CNT < time_us*SYSCLK);
}

void CPU_init(void){


	FLASH->ACR |= FLASH_ACR_ICEN			// Enable intruction cache
			    | FLASH_ACR_DCEN 			// Enable Date Cache
			    | FLASH_ACR_PRFTEN 			// Enable prefetch
			    | FLASH_ACR_LATENCY_3WS;	// Set Flash latency to 3 wait states

	RCC->PLLCFGR = (8 << 0)    // Set PLL_M to 8. The input clock frequency is divided by this value.
	             | (SYSCLK << 6)  // Set PLL_N, the multiplication factor for the PLL. SYSCLK is presumably defined elsewhere, representing the desired system clock frequency.
	             | (0 << 16)   // Set PLL_P to 2 (0 in register corresponds to PLL_P = 2). The PLL output frequency is divided by this value to get the system clock.
	             | (4 << 24);  // Set PLL_Q to 4. This value is used for USB, SDIO, and random number generator clocks, but it's not critical for the main system clock (SYSCLK).

	// Turn on the PLL and wait for it to become stable
	RCC->CR |= RCC_CR_PLLON;  // Enable the PLL
	while (!(RCC->CR & RCC_CR_PLLRDY)); // Wait for PLL to be ready (PLL ready flag)

	// Switch the system clock source to the PLL
	RCC->CFGR &= ~RCC_CFGR_SW;  // Clear the clock switch bits
	RCC->CFGR |= RCC_CFGR_SW_PLL;  // Set the clock source to PLL
	while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL); // Wait until PLL is used as the system clock source

	// Update the SystemCoreClock variable to the new clock speed
	SystemCoreClockUpdate(); // Update the SystemCoreClock global variable with the new clock frequency
	
	SystemInit();	// Enable FPU
}

void I2C1_init(void){

	// Assert PCLK1 = 50MHz

	//  • Program the peripheral input clock in I2C_CR2 Register in order to generate correct timings
	// 	• Configure the clock control registers
	// 	• Configure the rise time register
	// 	• Program the I2C_CR1 register to enable the peripheral
	// 	• Set the START bit in the I2C_CR1 register to generate a Start condition

	//PB7 = SDA
	//PB8 = SCL

	// Ideal Syntax: I2C1->CR2->FREQ = 331007;
	// The register is isolated and writing to other register bits outside of FREQ is prevented.
	// invalid inputs give errors/warnings

	RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;		// Enable I2C1 Peripheral Clock
	RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;	// Enable GPIOB Peripheral Clock

	GPIOB->MODER &= ~(GPIO_MODER_MODER7 | GPIO_MODER_MODER8); 				// Clear mode bits
    GPIOB->MODER |= (GPIO_MODER_MODER7_1 | GPIO_MODER_MODER8_1); 			// Alternate function mode
    GPIOB->OTYPER |= (GPIO_OTYPER_OT_7 | GPIO_OTYPER_OT_8); 				// Open-drain
    GPIOB->PUPDR &= ~(GPIO_PUPDR_PUPD7 | GPIO_PUPDR_PUPD8); 				// Clear pull-up/pull-down bits
    GPIOB->PUPDR |= (GPIO_PUPDR_PUPD7_0 | GPIO_PUPDR_PUPD8_0); 				// Pull-up
    GPIOB->OSPEEDR |= (GPIO_OSPEEDER_OSPEEDR7 | GPIO_OSPEEDER_OSPEEDR8);	// Very high speed

    GPIOB->AFR[0] |= (4 << (7 * 4)); 			// Set AFR bits to AF4 (I2C1) for PB7
    GPIOB->AFR[1] |= (4 << ((8 - 8) * 4)); 		// Set AFR bits to AF4 (I2C1) for PB8

	RCC->APB1RSTR |= RCC_APB1RSTR_I2C1RST;	// Reset I2C peripheral to clear any settings
    RCC->APB1RSTR &= ~RCC_APB1RSTR_I2C1RST;

	

	I2C1->CR2 |= (50 << I2C_CR2_FREQ_Pos) & I2C_CR2_FREQ_Msk;	// Set I2C1 Peripheral Clock Frequency to 50MHz
	
	// I2C1->CCR = (1 << I2C_CCR_FS_Pos) & I2C_CCR_FS_Msk;	// Set I2C1 Fast/Standard mode to Fast Mode
	I2C1->CCR |= (250 << I2C_CCR_CCR_Pos) & I2C_CCR_CCR_Msk;	// Set I2C1 Clock control register to 100kHz
	// CCR = Peripheral_Clock_1 / (3 * SCL_Output_Frequency)

	I2C1->TRISE |= (51 << I2C_TRISE_TRISE_Pos) & I2C_TRISE_TRISE_Msk;	//Set Maximum Rise Time to 1000ns
	//TRISE = Maximum_Rise_Time / Peripheral_Clock_1_Period + 1
	// 51   =       1000ns      /            20ns           + 1

	// TODO: Enable inturupts (ITEVFEN and ITBUFEN)
	I2C1->CR1 |= (1 << I2C_CR1_PE_Pos) & I2C_CR1_PE_Msk;	// Enable I2C1 Peripheral

