ExcessiveOverkill/drive-software-dev/STM32F413RG/Core/Src/main.c
	// I2C1->CR2 |= I2C_CR2_ITEVTEN | I2C_CR2_ITBUFEN | I2C_CR2_ITERREN;	// Enable I2C1 Interrupts

	// NVIC_EnableIRQ(I2C1_EV_IRQn);	// Configure NVIC for I2C1 Event Inturrpt
    // NVIC_EnableIRQ(I2C1_ER_IRQn);	// Configure NVIC for I2C1 Error Inturrpt
}

void I2C1_Start_Transmit(uint8_t address, uint8_t* data, uint8_t size) {

	// Assert no transmission is in progress

	I2C1->CR1 |= (1 << I2C_CR1_ACK_Pos);	// Enable I2C1 Acknowledge
	I2C1->CR1 |= I2C_CR1_START;	// Send START condition
	I2C1->DR |= address << 1;	// Set Data Resister to I2C Slave address
	

	while (!(I2C1->SR1 & I2C_SR1_TXE));
	I2C1->DR |= 0b01010101;
	while (!(I2C1->SR1 & I2C_SR1_BTF));

    // TODO: use interrupt to avoid wait
    // for (uint8_t i = 0; i < size; i++) {
    //     while (!(I2C1->SR1 & I2C_SR1_TXE)); 	// Wait until the TXIS (transmit interrupt status) flag is set

    //     I2C1->DR |= data[i];	// Send data
    // }


	// I2C1->CR1 |= I2C_CR1_POS;	// Send STOP condition

    // // TODO: use interrupt to avoid wait
    // while (!(I2C1->SR1 & I2C_SR1_BTF));	// Wait until the BTC (byte transfer complete) flag is set
}

void I2C1_Event_Interrupt_Handler(void){

	if (I2C1->SR1 & I2C_SR1_SB) {
        Start_Bit_Sent_Callback();
        I2C1->SR1 &= ~I2C_SR1_SB; // Clear the interrupt flag
    }
    if (I2C1->SR1 & I2C_SR1_ADDR) {
        Address_Sent_Callback();
        (void) I2C1->SR2; // Clear the interrupt flag by reading SR2
    }
    if (I2C1->SR1 & I2C_SR1_ADD10) {
        Ten_Bit_Header_Sent_Callback();
        I2C1->SR1 &= ~I2C_SR1_ADD10; // Clear the interrupt flag
    }
    if (I2C1->SR1 & I2C_SR1_STOPF) {
        Stop_Received_Callback();
        I2C1->CR1 |= I2C_CR1_PE; // Clear the STOPF flag by writing to CR1
    }
    if (I2C1->SR1 & I2C_SR1_BTF) {
        Data_Byte_Transfer_Finished_Callback();
        I2C1->SR1 &= ~I2C_SR1_BTF; // Clear the interrupt flag
    }
    if (I2C1->SR1 & I2C_SR1_RXNE) {
        Receive_Buffer_Not_Empty_Callback();
        I2C1->SR1 &= ~I2C_SR1_RXNE; // Clear the interrupt flag
    }
    if (I2C1->SR1 & I2C_SR1_TXE) {
        Transmit_Buffer_Empty_Callback();
        I2C1->SR1 &= ~I2C_SR1_TXE; // Clear the interrupt flag
    }
}

void I2C1_Error_Interrupt_Handler(void){

	if (I2C1->SR1 & I2C_SR1_BERR) {
        Bus_Error_Callback();
        I2C1->SR1 &= ~I2C_SR1_BERR; // Clear the interrupt flag
    }
    if (I2C1->SR1 & I2C_SR1_ARLO) {
        Arbitration_Loss_Callback();
        I2C1->SR1 &= ~I2C_SR1_ARLO; // Clear the interrupt flag
    }
    if (I2C1->SR1 & I2C_SR1_AF) {
        Acknowledge_Failure_Callback();
        I2C1->SR1 &= ~I2C_SR1_AF; // Clear the interrupt flag
    }
    if (I2C1->SR1 & I2C_SR1_OVR) {
        Overrun_Underrun_Callback();
        I2C1->SR1 &= ~I2C_SR1_OVR; // Clear the interrupt flag
    }
    if (I2C1->SR1 & I2C_SR1_PECERR) {
        PEC_Error_Callback();
        I2C1->SR1 &= ~I2C_SR1_PECERR; // Clear the interrupt flag
    }
    if (I2C1->SR1 & I2C_SR1_TIMEOUT) {
        Timeout_Tlow_Error_Callback();
        I2C1->SR1 &= ~I2C_SR1_TIMEOUT; // Clear the interrupt flag
    }
    if (I2C1->SR1 & I2C_SR1_SMBALERT) {
        SMBus_Alert_Callback();
        I2C1->SR1 &= ~I2C_SR1_SMBALERT; // Clear the interrupt flag
    }
}

void USART6_init(void){
	USART6->CR1 |= USART_CR1_UE;	// Enable USART1
	USART6->CR3 |= USART_CR3_DMAR;	// Enable DMA
	USART6->BRR |= USART_BRR_DIV_Mantissa;	// Program Baud rate Mantissa
	USART6->BRR |= USART_BRR_DIV_Fraction;	// Program Baud rate fraction
	USART6->CR1 |= USART_CR1_RE;	// Enable Receiver

}

void USART6_Error_Interrupt_Handler(void){

	if (USART6->SR & USART_SR_PE) {
        Parity_Error_Callback();
		// Cleared by read or write to USART_DR_DR
    }
	if (USART6->SR & USART_SR_FE) {
        Framing_Error_Callback();
		// Cleared by reading USART_DR_DR 
    }
	if (USART6->SR & USART_SR_NE) {
        Noise_Detected_Error_Callback();
		// Cleared by reading USART_DR_DR 
    }
	if (USART6->SR & USART_SR_ORE) {
        Overrun_Error_Callback();
		// Cleared by reading USART_DR_DR 
    }
}


void TIM1_init(void){

	RCC->APB2ENR |= RCC_APB2ENR_TIM1EN;		// Enable TIM1   Clock

	RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;	// Enable GPIOA  Clock
	RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;    // Enable GPIOB  Clock

	GPIOA->MODER = (GPIOA->MODER & ~GPIO_MODER_MODER8)  | GPIO_MODER_MODER8_1;	// Set UH  (PA8)  to AF mode
	GPIOA->MODER = (GPIOA->MODER & ~GPIO_MODER_MODER9)  | GPIO_MODER_MODER9_1;	// Set VH  (PA9)  to AF mode
	GPIOA->MODER = (GPIOA->MODER & ~GPIO_MODER_MODER10) | GPIO_MODER_MODER10_1;	// Set WH  (PA10) to AF mode
	GPIOB->MODER = (GPIOB->MODER & ~GPIO_MODER_MODER13) | GPIO_MODER_MODER13_1;	// Set UL  (PB13) to AF mode
	GPIOB->MODER = (GPIOB->MODER & ~GPIO_MODER_MODER14) | GPIO_MODER_MODER14_1;	// Set VL  (PB14) to AF mode
	GPIOB->MODER = (GPIOB->MODER & ~GPIO_MODER_MODER15) | GPIO_MODER_MODER15_1;	// Set WL  (PB15) to AF mode
	GPIOB->MODER = (GPIOB->MODER & ~GPIO_MODER_MODER12) | GPIO_MODER_MODER12_1;	// Set STO (PB12) to AF mode


	GPIOA->AFR[1] |= 1 << (4 * (8 - 8));	// Set UH  (PA8)  AF to TIM1_CH1
	GPIOA->AFR[1] |= 1 << (4 * (9 - 8));	// Set VH  (PA9)  AF to TIM1_CH2
	GPIOA->AFR[1] |= 1 << (4 * (10 - 8));	// Set WH  (PA10) AF to TIM1_CH3
	GPIOB->AFR[1] |= 1 << (4 * (13 - 8));	// Set UL  (PB13) AF to TIM1_CH1N
	GPIOB->AFR[1] |= 1 << (4 * (14 - 8));	// Set VL  (PB14) AF to TIM1_CH2N
	GPIOB->AFR[1] |= 1 << (4 * (15 - 8));	// Set WL  (PB15) AF to TIM1_CH3N
	GPIOB->AFR[1] |= 1 << (4 * (12 - 8));	// Set STO (PB12) AF to TIM1_BKIN


	uint32_t deadtime_ticks = (DEADTIME * SYSCLK) / 1000;
	TIM1->BDTR |= deadtime_ticks & TIM_BDTR_DTG;
	TIM1->BDTR |= TIM_BDTR_AOE;
	TIM1->BDTR |= TIM_BDTR_BKP;
	__NOP();__NOP();__NOP();		// Inserts a delay of 3 clock cycles
	TIM1->BDTR |= TIM_BDTR_BKE;		// Enable Brake (Safe Torque Off)
	__NOP();__NOP();__NOP();		// Inserts a delay of 3 clock cycles

	TIM1->CR1 |= TIM_CR1_CMS;     	// Set center-aligned mode
	TIM1->CR1 |= TIM_CR1_ARPE;		// Enable Auto-reload preload
	TIM1->ARR = 500*SYSCLK/PWMCLK;  // Auto-reload value for PWM frequency

	TIM1->CCMR1 |= TIM_CCMR1_OC1M_1 | TIM_CCMR1_OC1M_2; // PWM mode 1 on Channel 1
	TIM1->CCMR1 |= TIM_CCMR1_OC2M_1 | TIM_CCMR1_OC2M_2; // PWM mode 1 on Channel 2
	TIM1->CCMR2 |= TIM_CCMR2_OC3M_1 | TIM_CCMR2_OC3M_2; // PWM mode 1 on Channel 3

	TIM1->CCER |= TIM_CCER_CC1E | TIM_CCER_CC1NE; // Enable CH1 and CH1N
	TIM1->CCER |= TIM_CCER_CC2E | TIM_CCER_CC2NE; // Enable CH1 and CH1N
	TIM1->CCER |= TIM_CCER_CC3E | TIM_CCER_CC3NE; // Enable CH1 and CH1N

